# Используем образ с Go 1.22
FROM golang:1.22-alpine

# Устанавливаем рабочую директорию для всего проекта
WORKDIR /app

# Копируем go.mod и go.sum для установки зависимостей
COPY go.mod go.sum ./

# Устанавливаем зависимости
RUN go mod tidy

# Копируем весь проект в контейнер
COPY . .

# Устанавливаем рабочую директорию для сборки (папка с main.go)
WORKDIR /app/cmd

# Компилируем приложение
RUN go build -o main .

# Открываем порт для сервера (указываем порт, на котором будет работать сервер)
EXPOSE 8081

# Запускаем приложение
CMD ["./main"]
